app/views/users/favorites.html.erb

  <% @favorites.each do |favorite| %>
    <% record = Record.find_by(id: favorite.record_id) %>
---
SELECT "records".* FROM "records" WHERE "records"."id" = $1 LIMIT $2  [["id", 1], ["LIMIT", 1]]