app/views/records/show.html.erb

SELECT "favorites".* FROM "favorites" WHERE "favorites"."user_id" = $1 AND "favorites"."record_id" = $2 LIMIT $3  [["user_id", 1], ["record_id", 1], ["LIMIT", 1]]
---
  <div class="col-1">
    <% if Favorite.find_by(user_id: @current_user.id, record_id: @record.id) %>