app/controllers/favorites_controller.rb

  def create
    @favorite = Favorite.new(user_id: @current_user.id, record_id: params[:record_id])
    @favorite.save
---
INSERT INTO "favorites" ("user_id", "record_id", "created_at", "updated_at") VALUES ($1, $2, $3, $4) RETURNING "id"  [["user_id", 1], ["record_id", 1], ["created_at", "2023-02-08 12:40:39.842852"], ["updated_at", "2023-02-08 12:40:39.842852"]]

  def destroy
    @favorite = Favorite.find_by(user_id: @current_user.id, record_id: params[:record_id])
    @favorite.destroy
---
SELECT "favorites".* FROM "favorites" WHERE "favorites"."user_id" = $1 AND "favorites"."record_id" = $2 LIMIT $3  [["user_id", 1], ["record_id", 1], ["LIMIT", 1]]
DELETE FROM "favorites" WHERE "favorites"."id" = $1  [["id", 1]]