app/controllers/records_controller.rb

SELECT "records".* FROM "records" WHERE "records"."user_id" = $1 ORDER BY "records"."created_at" DESC  [["user_id", 1]]
---
  def index
    @records = Record.where(user_id: @current_user.id).order(created_at: :desc)

SELECT "records".* FROM "records" WHERE "records"."id" = $1 LIMIT $2  [["id", 1], ["LIMIT", 1]]
---
  def show
    @record = Record.find_by(id: params[:id])

INSERT INTO "records" ("title", "thoughts", "created_at", "updated_at", "user_id") VALUES ($1, $2, $3, $4, $5) RETURNING "id"  [["title", "もりもり"], ["thoughts", "もりもり"], ["created_at", "2023-02-08 12:39:57.455192"], ["updated_at", "2023-02-08 12:39:57.455192"], ["user_id", 1]]
---
  def create
    @record = Record.new(
      title: params[:title],
      thoughts: params[:thoughts],
      user_id: @current_user.id
      )
    if @record.save

SELECT "records".* FROM "records" WHERE "records"."id" = $1 LIMIT $2  [["id", 2], ["LIMIT", 1]]
---
  def edit
    @record = Record.find_by(id: params[:id])

SELECT "records".* FROM "records" WHERE "records"."id" = $1 LIMIT $2  [["id", 2], ["LIMIT", 1]]
UPDATE "records" SET "thoughts" = $1, "updated_at" = $2 WHERE "records"."id" = $3  [["thoughts", "えぐいって！！！！！！！！！！！！"], ["updated_at", "2023-02-08 13:22:56.191915"], ["id", 1]]
---
  def update
    @record = Record.find_by(id: params[:id])
    @record.title = params[:title]
    @record.thoughts = params[:thoughts]
    if @record.save

SELECT "records".* FROM "records" WHERE "records"."id" = $1 LIMIT $2  [["id", 1], ["LIMIT", 1]]
DELETE FROM "records" WHERE "records"."id" = $1  [["id", 1]]
---
  def destroy
    @record = Record.find_by(id: params[:id])
    @record.destroy